Revit 2027 API
ViewShapeBuilder Constructor
Overload List
Name | Description
ViewShapeBuilder() |  Default constructor for an ViewShapeBuilder object.
ViewShapeBuilder(DirectShapeTargetViewType) |  A constructor for an ViewShapeBuilder object that takes a view type. It will infer the view normal from view type. View normal and view type are used to validate the geometry to be stored as a view-specific shape representation of a DirectShape object.
Top
See Also
Reference
ViewShapeBuilder Class
Autodesk.Revit.DB Namespace